
&НаКлиенте
Процедура Выгрузить(Команда) 	
		
	ВыгрузитьНаСервере(Объект.Узел);     	
	
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ВыгрузитьНаСервере(Узел)
	
	Запись =  Новый ЗаписьXML;
	Запись.ОткрытьФайл("C:\Users\Desktop_New\Desktop\Обмен\Message_FROM_" 
			+ ПланыОбмена.ОбменСИдентичнойБазой.ЭтотУзел().Код 
			+ "_TO_" 
			+ Узел.Код 
			+ ".xml" );
	
	Запись.ЗаписатьОбъявлениеXML(); 
	
	// Создание записи-сообщения для  передачи в другую ИБ 
	ЗаписьСообщения = ПланыОбмена.СоздатьЗаписьСообщения();
	
	// Начало записи в файл XML	
	ЗаписьСообщения.НачатьЗапись(Запись, Узел);
	
	//Все Объекты, зарегистрированные для изменения 	
	Выборка = ПланыОбмена.ВыбратьИзменения(Узел,ЗаписьСообщения.НомерСообщения); 
	
	// Обход выборки в цикле	
	Пока Выборка.Следующий() Цикл  
		// получение Объекта
		Объект = Выборка.Получить();
		// запись Объекта
		ЗаписатьXML(Запись,Объект);		
	КонецЦикла;
	
	ЗаписьСообщения.ЗакончитьЗапись();	
	Запись.Закрыть();	
	
КонецПроцедуры

