


&НаКлиенте
Процедура Загрузить(Команда)
	ЗагрузитьНаСервере();
КонецПроцедуры


&НаСервере
Процедура ЗагрузитьНаСервере()
	
   НаборИзменений = Новый ЧтениеXML;
   
   НаборИзменений.ОткрытьФайл("C:\Users\Desktop_New\Desktop\Обмен\Message_FROM_" 
			+ Объект.Узел.Код 
			+ "_TO_" 
			+ ПланыОбмена.ОбменСИдентичнойБазой.ЭтотУзел().Код   
			+ ".xml" );
			
	// Объект для чтениия Сообщения
	ЧтениеСообщения = ПланыОбмена.СоздатьЧтениеСообщения();
	
	// Чтение из Файла
	ЧтениеСообщения.НачатьЧтение(НаборИзменений);
	
	// Обход XML
	Пока  ВозможностьЧтенияXML(НаборИзменений) Цикл 
		
		// по-Объектно пишем 
		ОбъектИзФайла = ПрочитатьXML(НаборИзменений);
		ОбъектИзФайла.Записать();			
	КонецЦикла; 
	
	// Завершение чтения	
	ЧтениеСообщения.ЗакончитьЧтение(); 
	
	// закрытие Файла	
	НаборИзменений.Закрыть();


КонецПроцедуры


